In [1]:
import pandas as pd

In [2]:
pd.read_excel(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\sales data.xlsx",sheet_name="Sheet1")

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Meera,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Vihaan,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Nishant,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Vihaan,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Aditi,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Riya,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Ishita,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Kabir,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Ananya,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Kabir,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [2]:
df= pd.read_excel(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\sales data.xlsx",sheet_name="Sheet1")

## 1ðŸ”¹ **Basic Operations**
| Function/Method  | Description                             |
|------------------|------------------------------------------|
| `s.head(n)`      | First `n` items                          |
| `s.tail(n)`      | Last `n` items                           |
| `s.copy()`       | Copy the Series                          |
| `s.astype(dtype)`| Convert data type                        |
| `s.drop(labels)` | Remove items by index                    |
| `s.replace(a, b)`| Replace values                           |

In [4]:
df.shape

(1000, 10)

In [5]:
df.columns

Index(['Sale_Date', 'Customer Name', 'City', 'State', 'Region',
       'Product Category', 'Product Name', 'Quantity', 'Price per Unit',
       'Sales Amount'],
      dtype='object')

In [6]:
df.head()

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Meera,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Vihaan,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Nishant,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Vihaan,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Aditi,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09

In [7]:
df.tail()

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
995,2023-04-15,Riya,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Ishita,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Kabir,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Ananya,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Kabir,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [8]:
df.sample()

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
739,2023-09-15,Ananya,Madurai,Tamil Nadu,South,Electronics,Tablet,8,2784.08,22272.64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Sale_Date         1000 non-null   datetime64[ns]
 1   Customer Name     1000 non-null   object
 2   City              1000 non-null   object
 3   State             1000 non-null   object
 4   Region            1000 non-null   object
 5   Product Category  1000 non-null   object
 6   Product Name      1000 non-null   object
 7   Quantity          1000 non-null   int64
 8   Price per Unit    1000 non-null   float64
 9   Sales Amount      1000 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(6)
memory usage: 78.3+ KB

In [15]:
df["Quantity"].astype("float")

0       6.0
1       9.0
2      11.0
3       9.0
4      17.0
       ...
995    14.0
996     6.0
997    10.0
998    15.0
999     2.0
Name: Quantity, Length: 1000, dtype: float64

In [13]:
df['Sale_Date'].astype("O")

0      2023-02-03 00:00:00
1      2023-04-21 00:00:00
2      2023-09-21 00:00:00
3      2023-08-24 00:00:00
4      2023-03-24 00:00:00
              ...
995    2023-04-15 00:00:00
996    2023-09-07 00:00:00
997    2023-04-27 00:00:00
998    2023-12-20 00:00:00
999    2023-08-16 00:00:00
Name: Sale_Date, Length: 1000, dtype: object

In [16]:
df.drop("Customer Name",axis=1)

,Sale_Date,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [17]:
df.drop(columns=["Customer Name"])

,Sale_Date,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [9]:
df.City.replace("Nagpur","Kolkata")

0         Kolkata
1      Coimbatore
2       Bengaluru
3         Madurai
4          Mumbai
          ...
995    Coimbatore
996       Kolkata
997     Bengaluru
998     Bengaluru
999        Mumbai
Name: City, Length: 1000, dtype: object

In [18]:
df

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Meera,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Vihaan,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Nishant,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Vihaan,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Aditi,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Riya,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Ishita,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Kabir,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Ananya,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Kabir,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [19]:
df=df.drop(columns=["Customer Name"])

In [20]:
df

,Sale_Date,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

## 2 **Attributes**
| Attribute         | Description                      |
|------------------|----------------------------------|
| `s.index`        | Index (labels) of the Series     |
| `s.values`       | Values (data) of the Series      |
| `s.dtype`        | Data type                        |
| `s.shape`        | Shape of the Series              |
| `s.size`         | Number of elements               |
| `s.ndim`         | Number of dimensions (always 1)  |
| `s.name`         | Name of the Series               |
| `s.is_unique`    | Checks if all elements are unique|
| `s.hasnans`      | Checks for NaN values            |

---

# columns = axis=1

# row = axis=0

In [22]:
# pakka delete
df.drop('City',axis=1,inplace=True)

In [23]:
df

,Sale_Date,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...
995,2023-04-15,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [24]:
df.drop(columns=["State","Product Category",'Price per Unit'],axis=1)

     Sale_Date Region Product Name  Quantity  Sales Amount
0   2023-02-03   West        Table         6      24097.50
1   2023-04-21  South        Ruler         9      34216.65
2   2023-09-21  South        Ruler        11      39534.77
3   2023-08-24  South        Dress         9      40383.00
4   2023-03-24   West      Lentils        17      21093.09
..         ...    ...          ...       ...           ...
995 2023-04-15  South          Oil        14      63460.32
996 2023-09-07   West          Bed         6      10257.12
997 2023-04-27  South        Dress        10      38032.20
998 2023-12-20  South     Notebook        15      27795.00
999 2023-08-16   West        Pants         2       5246.86

[1000 rows x 5 columns]

In [25]:
df

,Sale_Date,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...
995,2023-04-15,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [26]:
df.drop(columns=["State","Product Category"],axis=1,inplace=True)

In [27]:
df

     Sale_Date Region Product Name  Quantity  Price per Unit  Sales Amount
0   2023-02-03   West        Table         6         4016.25      24097.50
1   2023-04-21  South        Ruler         9         3801.85      34216.65
2   2023-09-21  South        Ruler        11         3594.07      39534.77
3   2023-08-24  South        Dress         9         4487.00      40383.00
4   2023-03-24   West      Lentils        17         1240.77      21093.09
..         ...    ...          ...       ...             ...           ...
995 2023-04-15  South          Oil        14         4532.88      63460.32
996 2023-09-07   West          Bed         6         1709.52      10257.12
997 2023-04-27  South        Dress        10         3803.22      38032.20
998 2023-12-20  South     Notebook        15         1853.00      27795.00
999 2023-08-16   West        Pants         2         2623.43       5246.86

[1000 rows x 6 columns]

In [28]:
df = df.drop(columns=['Price per Unit'],axis=1)

In [29]:
df

     Sale_Date Region Product Name  Quantity  Sales Amount
0   2023-02-03   West        Table         6      24097.50
1   2023-04-21  South        Ruler         9      34216.65
2   2023-09-21  South        Ruler        11      39534.77
3   2023-08-24  South        Dress         9      40383.00
4   2023-03-24   West      Lentils        17      21093.09
..         ...    ...          ...       ...           ...
995 2023-04-15  South          Oil        14      63460.32
996 2023-09-07   West          Bed         6      10257.12
997 2023-04-27  South        Dress        10      38032.20
998 2023-12-20  South     Notebook        15      27795.00
999 2023-08-16   West        Pants         2       5246.86

[1000 rows x 5 columns]

In [31]:
df["Region"].index

RangeIndex(start=0, stop=1000, step=1)

In [1]:
#df["Region"].values

In [33]:
df["Region"].dtype

dtype('O')

In [34]:
df["Region"].is_unique

False

In [35]:
df["Region"].unique()

array(['West', 'South', 'North'], dtype=object)

In [36]:
df["Region"].size

1000

In [37]:
df["Region"].ndim

1

In [39]:
df["Region"].hasnans

False

In [41]:
df.isna().sum()

Sale_Date       0
Region          0
Product Name    0
Quantity        0
Sales Amount    0
dtype: int64

## 3. **Logical/Boolean**
| Method             | Description                          |
|--------------------|--------------------------------------|
| `s.isnull()`       | Detect missing values (NaN)          |
| `s.notnull()`      | Opposite of `isnull()`               |
| `s.any()`          | If any True                          |
| `s.all()`          | If all True                          |
| `s.where(cond)`    | Keep values where condition is True  |
| `s.mask(cond)`     | Mask values where condition is True  |

In [4]:
data= pd.read_csv(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\Titanic-Dataset (2).csv")

In [43]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [44]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [46]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [47]:
data.isna().mean()*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [25]:
data['Fare'][data["Fare"]==0]

179    0.0
263    0.0
271    0.0
277    0.0
302    0.0
413    0.0
466    0.0
481    0.0
597    0.0
633    0.0
674    0.0
732    0.0
806    0.0
815    0.0
822    0.0
Name: Fare, dtype: float64

In [23]:
age = data['Age'][data["Age"]<1]
age

78     0.83
305    0.92
469    0.75
644    0.75
755    0.67
803    0.42
831    0.83
Name: Age, dtype: float64

In [20]:
x=data['Age'].where(data['Age']>1,1)
x

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     1.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [27]:
data['Survived'].where(data["Survived"]==1,"No")

0      No
1       1
2       1
3       1
4      No
       ..
886    No
887     1
888    No
889     1
890    No
Name: Survived, Length: 891, dtype: object

In [29]:
data['Survived'].mask(data["Survived"]==1,"No")

0       0
1      No
2      No
3      No
4       0
       ..
886     0
887    No
888     0
889    No
890     0
Name: Survived, Length: 891, dtype: object

## 4. **Sorting & Ranking**
| Method              | Description                     |
|---------------------|---------------------------------|
| `s.sort_values()`   | Sort by values                  |
| `s.sort_index()`    | Sort by index                   |
| `s.rank()`          | Rank of each element            |

In [30]:
data['Survived'].unique()

array([0, 1])

In [32]:
data['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [34]:
data['Age'].sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

In [37]:
Age = data['Age'].sort_values(ascending=False)
Age

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

In [38]:
Age.sort_index()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [40]:
Age = data['Age'].sort_values()
Age.rank()

803    1.0
755    2.0
644    3.5
469    3.5
78     5.5
      ...
859    NaN
863    NaN
868    NaN
878    NaN
888    NaN
Name: Age, Length: 891, dtype: float64

In [42]:
data['Embarked'].value_counts().rank()

Embarked
S    3.0
C    2.0
Q    1.0
Name: count, dtype: float64

## 5. **Aggregation**
| Method              | Description                     |
|---------------------|---------------------------------|
| `s.count()`         | Count non-null values           |
| `s.describe()`      | Summary statistics              |
| `s.value_counts()`  | Frequency of unique values      |
| `s.unique()`        | Unique values                   |
| `s.nunique()`       | Number of unique values         |

In [43]:
data['Age'].count()

np.int64(714)

In [48]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [54]:
data.describe(include="O")
# data.describe(include="object")

                       Name   Sex  Ticket Cabin Embarked
count                   891   891     891   204      889
unique                  891     2     681   147        3
top     Dooley, Mr. Patrick  male  347082    G6        S
freq                      1   577       7     4      644

In [44]:
data['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [46]:
data['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [47]:
data['Embarked'].nunique()

3

# 6. **Indexing and Selection**
| Method            | Description                          |
|-------------------|--------------------------------------|
| `s[0]`, `s['a']`  | Access by position or label          |
| `s.loc['a']`      | Label-based selection                |
| `s.iloc[0]`       | Position-based selection             |
| `s.at['a']`       | Fast label access                    |
| `s.iat[0]`        | Fast position access                 |
| `s.get(key)`      | Safe getter                          |

---
- **loc:**
It selects data by labels (row and column names). It can handle single labels, lists of labels, and slices with labels.
- **iloc:**
It selects data by integer positions (row and column indices). It also accepts single integers, lists of integers, and slices with integers.
- **at:**
It accesses a single value by label. It is optimized for speed when accessing individual elements.
- **iat:**
It accesses a single value by integer position. Similar to at, it is optimized for fast access to scalar values.

In [5]:
data["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [6]:
data["Name"][2]

'Heikkinen, Miss. Laina'

In [7]:
data['Name'].get(100)

'Petranec, Miss. Matilda'

In [9]:
data[["Survived","Name"]]

     Survived                                               Name
0           0                            Braund, Mr. Owen Harris
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1                             Heikkinen, Miss. Laina
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0                           Allen, Mr. William Henry
..        ...                                                ...
886         0                              Montvila, Rev. Juozas
887         1                       Graham, Miss. Margaret Edith
888         0           Johnston, Miss. Catherine Helen "Carrie"
889         1                              Behr, Mr. Karl Howell
890         0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [14]:
data["Name"][0:5:2]

0     Braund, Mr. Owen Harris
2      Heikkinen, Miss. Laina
4    Allen, Mr. William Henry
Name: Name, dtype: object

In [13]:
data.loc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [16]:
data.loc[[2,3,5]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [17]:
data.iloc[[1,3,5,7,9,11],[1,3,5]]

    Survived                                               Name   Age
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
3          1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
5          0                                   Moran, Mr. James   NaN
7          0                     Palsson, Master. Gosta Leonard   2.0
9          1                Nasser, Mrs. Nicholas (Adele Achem)  14.0
11         1                           Bonnell, Miss. Elizabeth  58.0

In [18]:
data.iloc[1:10,2:6]

   Pclass                                               Name     Sex   Age
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2       3                             Heikkinen, Miss. Laina  female  26.0
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4       3                           Allen, Mr. William Henry    male  35.0
5       3                                   Moran, Mr. James    male   NaN
6       1                            McCarthy, Mr. Timothy J    male  54.0
7       3                     Palsson, Master. Gosta Leonard    male   2.0
8       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
9       2                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0

In [20]:
data.iloc[:5,:-1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN

## 7 **Math & Stats**
| Method            | Description                          |
|-------------------|--------------------------------------|
| `s.sum()`         | Sum of elements                      |
| `s.mean()`        | Average                              |
| `s.median()`      | Median                               |
| `s.mode()`        | Most frequent value(s)               |
| `s.min()`         | Minimum                              |
| `s.max()`         | Maximum                              |
| `s.std()`         | Standard deviation                   |
| `s.var()`         | Variance                             |
| `s.cumsum()`      | Cumulative sum                       |
| `s.cumprod()`     | Cumulative product                   |
| `s.abs()`         | Absolute values                      |
| `s.round(n)`      | Round to `n` decimal places          |

In [8]:
data= pd.read_csv(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\Titanic-Dataset (2).csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [13]:
data["Survived"].sum()

np.int64(342)

In [16]:
round(data["Survived"].mean(),2)

np.float64(0.38)

In [19]:
data["Age"].median()

np.float64(28.0)

In [20]:
data["Fare"].mode()

0    8.05
Name: Fare, dtype: float64

In [21]:
data["Fare"].min()

np.float64(0.0)

In [22]:
data["Fare"].max()

np.float64(512.3292)

## 8 **String Operations** (if Series contains strings)
| Method                 | Example                       |
|------------------------|-------------------------------|
| `s.str.lower()`        | Convert to lowercase          |
| `s.str.upper()`        | Convert to uppercase          |
| `s.str.contains('x')`  | Check if contains 'x'         |
| `s.str.replace('a','b')`| Replace 'a' with 'b'         |
| `s.str.strip()`        | Remove whitespace             |
| `s.str.len()`          | Length of each string         |

In [1]:
import pandas as pd

In [4]:
data= pd.read_csv(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\Titanic-Dataset (2).csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## 9 **Date/Time Functions** (if Series is datetime)
| Method               | Description                    |
|----------------------|--------------------------------|
| `s.dt.year`          | Extract year                   |
| `s.dt.month`         | Extract month                  |
| `s.dt.day`           | Extract day                    |
| `s.dt.weekday`       | Day of week (0=Mon)            |
| `s.dt.strftime()`    | Format dates as string         |

In [3]:
df2 = pd.read_excel(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\sales data.xlsx",sheet_name="Sheet1")

In [29]:
df2

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Meera,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Vihaan,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Nishant,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Vihaan,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Aditi,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Riya,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Ishita,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Kabir,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Ananya,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Kabir,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [31]:
df2["Sale_Date"].dt.year

0      2023
1      2023
2      2023
3      2023
4      2023
       ...
995    2023
996    2023
997    2023
998    2023
999    2023
Name: Sale_Date, Length: 1000, dtype: int32

In [32]:
df2["Sale_Date"].dt.month

0       2
1       4
2       9
3       8
4       3
       ..
995     4
996     9
997     4
998    12
999     8
Name: Sale_Date, Length: 1000, dtype: int32

In [33]:
df2["Sale_Date"].dt.day

0       3
1      21
2      21
3      24
4      24
       ..
995    15
996     7
997    27
998    20
999    16
Name: Sale_Date, Length: 1000, dtype: int32

In [34]:
df2["Sale_Date"].dt.weekday

0      4
1      4
2      3
3      3
4      4
      ..
995    5
996    3
997    3
998    2
999    2
Name: Sale_Date, Length: 1000, dtype: int32

In [36]:
df2["Sale_Date"].dt.strftime("%Y-%m-%d")

0      2023-02-03
1      2023-04-21
2      2023-09-21
3      2023-08-24
4      2023-03-24
          ...
995    2023-04-15
996    2023-09-07
997    2023-04-27
998    2023-12-20
999    2023-08-16
Name: Sale_Date, Length: 1000, dtype: object

## 10 **Other Useful Methods**
| Method                  | Description                   |
|--------------------------|-------------------------------|
| `s.duplicated()`        | Detect duplicate values        |
| `s.between(a, b)`       | Values between a and b         |
| `s.add()`, `s.sub()`     | Add or subtract series         |
| `s.clip(lower, upper)` | Limit values to a range        |
| `s.apply(func)`         | Apply a function element-wise  |
| `s.map(func/dict)`      | Map values using function/dict |

In [26]:
df2

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Meera,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Vihaan,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Nishant,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Vihaan,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Aditi,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Riya,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Ishita,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Kabir,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Ananya,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Kabir,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [8]:
df2.duplicated().sum()

np.int64(0)

In [5]:
df2['Sales Amount'][df2['Sales Amount'].between(10000,20000)]

6      10984.95
21     12571.56
27     17495.00
32     17629.85
40     11135.36
         ...
974    11442.36
981    14566.32
986    18897.32
992    14638.44
996    10257.12
Name: Sales Amount, Length: 191, dtype: float64

In [6]:
df2[df2['Sales Amount'].between(20000,30000)]

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Meera,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
4,2023-03-24,Aditi,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
9,2023-10-09,Nishant,Chennai,Tamil Nadu,South,Furniture,Table,10,2754.30,27543.00
12,2023-11-11,Ishita,Mumbai,Maharashtra,West,Stationery,Eraser,6,4231.77,25390.62
13,2023-12-31,Aryan,Ahmedabad,Gujarat,West,Clothing,Shirt,20,1027.53,20550.60
...,...,...,...,...,...,...,...,...,...,...
979,2023-12-19,Aryan,Karol Bagh,Delhi,North,Groceries,Sugar,6,3918.07,23508.42
987,2023-01-04,Aryan,New Delhi,Delhi,North,Electronics,Smartphone,7,3481.00,24367.00
989,2023-12-30,Ananya,Pune,Maharashtra,West,Electronics,Tablet,10,2336.88,23368.80
993,2023-06-26,Ishita,New Delhi,Delhi,North,Clothing,Jacket,12,1819.46,21833.52
998,2023-12-20,Ananya,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00

In [11]:
df2['Sales Amount'].clip(20000,30000)

0      24097.50
1      30000.00
2      30000.00
3      30000.00
4      21093.09
         ...
995    30000.00
996    20000.00
997    30000.00
998    27795.00
999    20000.00
Name: Sales Amount, Length: 1000, dtype: float64

In [13]:
mayank=pd.Series([x for x in range(100)])

In [15]:
mayank[mayank.between(10,25)]

10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: int64

In [16]:
mayank.clip(10,25)

0     10
1     10
2     10
3     10
4     10
      ..
95    25
96    25
97    25
98    25
99    25
Length: 100, dtype: int64

In [17]:
df2['Quantity'].apply(lambda x:x+10)

0      16
1      19
2      21
3      19
4      27
       ..
995    24
996    16
997    20
998    25
999    12
Name: Quantity, Length: 1000, dtype: int64

In [23]:
df2['Price per Unit'].apply(lambda x:x*1.05)

0      4217.0625
1      3991.9425
2      3773.7735
3      4711.3500
4      1302.8085
         ...
995    4759.5240
996    1794.9960
997    3993.3810
998    1945.6500
999    2754.6015
Name: Price per Unit, Length: 1000, dtype: float64

In [22]:
df2['Sales Amount'].apply(lambda x:round(x))

0      24098
1      34217
2      39535
3      40383
4      21093
       ...
995    63460
996    10257
997    38032
998    27795
999     5247
Name: Sales Amount, Length: 1000, dtype: int64

In [26]:
df2['Sales Amount'].transform(lambda x:round(x))

0      24098
1      34217
2      39535
3      40383
4      21093
       ...
995    63460
996    10257
997    38032
998    27795
999     5247
Name: Sales Amount, Length: 1000, dtype: int64

# transform and apply same hai

In [27]:
df2['Region'].unique()

array(['West', 'South', 'North'], dtype=object)

In [28]:
D = {'West':'W', 'South':'S', 'North':'N'}
df2['Region'].map(D)

0      W
1      S
2      S
3      S
4      W
      ..
995    S
996    W
997    S
998    S
999    W
Name: Region, Length: 1000, dtype: object